## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_billing_budget.my-cap-billing-budget will be created
+   resource "google_billing_budget" "my-cap-billing-budget" {
+       billing_account = "015525-9D090C-CC8778"
+       display_name    = "Unlink terrateam-362405 from billing account"
+       id              = (known after apply)
+       name            = (known after apply)

+       all_updates_rule {
+           disable_default_iam_recipients = false
+           pubsub_topic                   = (known after apply)
+           schema_version                 = "1.0"
        }

+       amount {
+           specified_amount {
+               currency_code = (known after apply)
+               units         = "1000"
            }
        }

+       budget_filter {
+           credit_types           = (known after apply)
+           credit_types_treatment = "INCLUDE_ALL_CREDITS"
+           labels                 = (known after apply)
+           projects               = [
+               "projects/1037290380438",
            ]
+           services               = (known after apply)
+           subaccounts            = (known after apply)
        }

+       threshold_rules {
+           spend_basis       = "CURRENT_SPEND"
+           threshold_percent = 1
        }
    }

  # google_cloudfunctions_function.my-cap-billing-function will be created
+   resource "google_cloudfunctions_function" "my-cap-billing-function" {
+       available_memory_mb           = 128
+       description                   = "Function to unlink project from billing account"
+       docker_registry               = (known after apply)
+       entry_point                   = "stop_billing"
+       environment_variables         = (known after apply)
+       https_trigger_security_level  = (known after apply)
+       https_trigger_url             = (known after apply)
+       id                            = (known after apply)
+       ingress_settings              = "ALLOW_ALL"
+       labels                        = {
+           "terraform" = "true"
        }
+       max_instances                 = 1
+       min_instances                 = 0
+       name                          = (known after apply)
+       project                       = "terrateam-362405"
+       region                        = "us-central1"
+       runtime                       = "python39"
+       service_account_email         = (known after apply)
+       source_archive_bucket         = (known after apply)
+       source_archive_object         = "function-source-5f9c9f0fa28ad36189eeec18338eb0c3.zip"
+       timeout                       = 120
+       vpc_connector_egress_settings = (known after apply)

+       event_trigger {
+           event_type = "google.pubsub.topic.publish"
+           resource   = "cap-billing-alert"

+           failure_policy {
+               retry = false
            }
        }
    }

  # google_project_iam_custom_role.my-cap-billing-role will be created
+   resource "google_project_iam_custom_role" "my-cap-billing-role" {
+       deleted     = (known after apply)
+       description = "Custom role to unlink project from billing account"
+       id          = (known after apply)
+       name        = (known after apply)
+       permissions = [
+           "resourcemanager.projects.deleteBillingAssignment",
        ]
+       project     = "terrateam-362405"
+       role_id     = "myCapBilling"
+       stage       = "GA"
+       title       = "Cap Billing Custom Role"
    }

  # google_project_iam_member.my-cap-billing-role-binding will be created
+   resource "google_project_iam_member" "my-cap-billing-role-binding" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "terrateam-362405"
+       role    = (known after apply)
    }

  # google_pubsub_subscription.my-cap-billing-pubsub-pull will be created
+   resource "google_pubsub_subscription" "my-cap-billing-pubsub-pull" {
+       ack_deadline_seconds       = (known after apply)
+       id                         = (known after apply)
+       message_retention_duration = "604800s"
+       name                       = "cap-billing-alert-pull"
+       project                    = "terrateam-362405"
+       topic                      = "cap-billing-alert"

+       expiration_policy {
+           ttl = (known after apply)
        }
    }

  # google_pubsub_topic.my-cap-billing-pubsub will be created
+   resource "google_pubsub_topic" "my-cap-billing-pubsub" {
+       id      = (known after apply)
+       labels  = {
+           "terraform" = "true"
        }
+       name    = "cap-billing-alert"
+       project = "terrateam-362405"

+       message_storage_policy {
+           allowed_persistence_regions = [
+               "us-central1",
            ]
        }

+       schema_settings {
+           encoding = (known after apply)
+           schema   = (known after apply)
        }
    }

  # google_service_account.my-cap-billing-service-account will be created
+   resource "google_service_account" "my-cap-billing-service-account" {
+       account_id   = "sa-cap-billing"
+       description  = "Service Account to unlink project from billing account"
+       disabled     = false
+       display_name = "Cap Billing"
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       project      = "terrateam-362405"
+       unique_id    = (known after apply)
    }

  # google_storage_bucket.my-cap-billing-bucket will be created
+   resource "google_storage_bucket" "my-cap-billing-bucket" {
+       force_destroy               = true
+       id                          = (known after apply)
+       labels                      = {
+           "terraform" = "true"
        }
+       location                    = "US-CENTRAL1"
+       name                        = (known after apply)
+       project                     = "terrateam-362405"
+       self_link                   = (known after apply)
+       storage_class               = "STANDARD"
+       uniform_bucket_level_access = true
+       url                         = (known after apply)
    }

  # google_storage_bucket_object.my-cap-billing-archive will be created
+   resource "google_storage_bucket_object" "my-cap-billing-archive" {
+       bucket         = (known after apply)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "function-source-5f9c9f0fa28ad36189eeec18338eb0c3.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "./function-source.zip"
+       storage_class  = (known after apply)
    }

  # null_resource.wait-for-archive will be created
+   resource "null_resource" "wait-for-archive" {
+       id = (known after apply)
    }

  # null_resource.wait-for-sa will be created
+   resource "null_resource" "wait-for-sa" {
+       id = (known after apply)
    }

  # random_id.my-cap-billing-function will be created
+   resource "random_id" "my-cap-billing-function" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 8
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_uuid.my-cap-billing-bucket will be created
+   resource "random_uuid" "my-cap-billing-bucket" {
+       id     = (known after apply)
+       result = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:. workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
